import React, { useState } from "react";
import { Button, InputGroup, Modal } from "react-bootstrap";
import { useDispatch } from "react-redux";
import { updateRules } from "../redux/middleware/axios";

const Rules = () => {
  const dispatch = useDispatch();
  const [show, setShow] = useState(true);
  const [check, setCheck] = useState(true);

  const checked = (e) => {
    setCheck(!check);
  };

  const handleClose = () => {
    dispatch(updateRules(sessionStorage.getItem("token")));
    setShow(false);
  };
  return (
    <Modal show={show}>
      <Modal.Header>
        <Modal.Title>Охорони праці кабінеті технології</Modal.Title>
      </Modal.Header>
      <Modal.Body>
        <p>
          Інструкція з охорони праці для учнів у кабінеті технології
          (обслуговуючої праці) <br /> 1. Загальні положення інструкції в
          кабінеті технології. <br /> 1.1. Ця інструкція з охорони праці для
          учнів у кабінеті обслуговуючої праці призначена для учнів школи
          (дівчаток), що займаються на уроках технології (обслуговуючої праці).{" "}
          <br /> 1.2. Відповідно до начальної програми з технології, учні на
          першому уроці та протягом року проходять інструктажі з техніки безпеки
          з метою ознайомлення учнів зі способами попередження травмування.{" "}
          <br /> 1.3. Шкідливими і небезпечними факторами при проведенні робіт у
          кабінеті технології можуть бути: <br /> - травмування пальців рук при
          необережному поводженні з голками, шпильками, ножицями, швейною
          машинкою; <br /> - опіки рук при дотику до нагрітих металевих частин
          праски або парою при рясному змочуванні матеріалу; <br /> - ураження
          електричним струмом; <br /> - виникнення пожежі при залишенні праски,
          включеної в електромережу, без нагляду; <br /> 1.4. Вхід до кабінету
          технології дозволяється лише з дозволу вчителя. <br /> 1.5. Проходи
          між столами не повинні захаращуватися портфелями і сумками. <br />{" "}
          1.6. Учні повинні знати місце знаходження первинних засобів
          пожежогасіння у кабінеті технології , знати порядок дій при евакуації.{" "}
          <br /> 1.7. Учні, що допустили невиконання або порушення інструкції з
          техніки безпеки у кабінеті технології, притягаються до
          відповідальності, а з усіма учнями проводиться позаплановий інструктаж
          з охорони праці. <br /> 2. Вимоги безпеки перед початком уроку
          технології. <br /> 2.1. Перед початком уроку учні надягають фартухи,
          волосся ретельно заправляють під косинки. <br /> 2.2. Перед роботою з
          тканиною учні перевіряють відсутність іржавих голок і шпильок. <br />{" "}
          2.3. Перед користуванням праскою учні візуально перевіряють справність
          ізоляції електричного дроту та вилки праски, необхідно також
          переконатися в наявності термостійкої підставки для праски та
          діелектричного килимка на підлозі біля гладильної дошки. <br /> 3.
          Вимоги безпеки під час уроку технології. <br /> 3.1. На уроках
          обслуговуючої праці учні виконують програмні види робіт, за які
          отримують поточні, підсумкові та четвертні оцінки. У підготовчій
          частині уроку учні отримують знання щодо безпечної організації праці,
          про прийоми та методи безпеки роботи. <br /> 3.2. Працювати дівчаткам
          необхідно акуратно, неухильно дотримуючись порядку проведення роботи,
          виконуючи інструкцію з охорони праці для дівчаток в кабінеті
          технології школи, вимоги охорони праці при проведенні практичних
          робіт. <br /> 3.3. Протягом уроку учні повинні дотримуватися наступних
          правил: - не починати заняття без дозволу вчителя; - дотримуватися
          правил техніки безпеки при роботі з різними інструментами та машинами;
          - самовільно не залишати місце роботи; - не виконувати інші дії без
          дозволу вчителя; - дотримуватися правил і норм поведінки. <br /> 3.4.
          Вмикайте електрообладнання в мережу і вимикайте сухими руками,
          тримаючись за корпус вилки, а не за шнур. <br />
          3.5. Пальці рук тримайте на безпечній відстані від рухомих частин
          швейної машинки. <br /> 3.6. Не залишайте без нагляду увімкнені
          нагрівальні прилади, праскау необхідно ставити тільки на підставку.{" "}
          <br /> 3.7. Щоб уникнути опіків рук, не торкатися гарячих металевих
          частин праски і не змочувати рясно матеріал водою. <br /> 3.8. Не
          користуйтеся при роботі з тканиною іржавими голками та шпильками, ні в
          якому разі не беріть голки і шпильки в рот, не вколюйте їх в одяг.{" "}
          <br /> 3.9. Зберігати голки і шпильки у призначеному для цього місці
          (подушечці, спеціальній коробці тощо), не залишати їх на робочому
          місці. <br /> 3.10. Шити голками тільки з наперстком. <br /> 4. Вимоги
          безпеки після закінчення уроку технології. <br /> 4.1. Відключити
          електрообладнання від мережі. <br /> 4.2. Перевірити поверхню робочого
          столу на відсутність голок та шпильок, привести в порядок своє робоче
          місце. <br /> 4.3. Зняти спецодяг і вимити руки з милом. <br /> 5.
          Вимоги безпеки в аварійних ситуаціях. <br /> 5.1. При виникненні під
          час занять в кабінеті технології надзвичайних ситуацій, учням слід
          виконувати всі вказівки вчителя, не допускаючи паніки та діяти згідно
          з вимогами інструкції з охорони праці для учнів у кабінеті технології.{" "}
          <br />
          5.2. При виникненні несправності в роботі електричної праски, появі
          іскріння, гару, диму тощо, негайно вимкнути праску з електромережі і
          повідомити про це вчителя. <br /> 5.3. При виникненні пожежі негайно
          відключити електричну праску від електромережі і приступити до гасіння
          осередку загоряння первинними засобами пожежогасіння: пісок, совок,
          брезент, вогнегасник. <br /> 5.4. При отриманні травми, повідомте про
          це вчителя технології, при необхідності надайте допомогу потерпілому.
        </p>
      </Modal.Body>
      <Modal.Footer>
        <InputGroup.Checkbox
          aria-label="Checkbox for following text input"
          onClick={checked}
        />
        <label htmlFor="basic-url">З правилами безпеки погоджуюся</label>
        <Button variant="primary" onClick={handleClose} disabled={check}>
          Підтвердити
        </Button>
      </Modal.Footer>
    </Modal>
  );
};

export default Rules;
